<?php

return [
    'nav' => 'Кабинет агента',
    'page' => [
        'create' => [
            'title' => 'Страница создания агента',
            'form' => [
                'title' => 'Создать агента',
                'input' => [
                    'agency' => [
                        'label' => 'Выбрать агенство:'
                    ]
                ],
                'errors' => [
                    'agency_id' => [
                        'required' => 'Необходимо выбрать агенство',
                    ],
                    'user_id' => [
                        'unique' => 'Данный агент уже зарегистрирован'
                    ]
                ]
            ]
        ]
    ]
];
