<?php

return [
    'page' => [
        'profile' => [
            'nav' => 'Кабинет агента',
            'show' => [
                'block' => [
                    'register' => [
                        'description' => 'Вы пока не являетесь Агентом ни одного Агенства, но можете <a href="' . route('agent.create') . '">им стать</a>'
                    ]
                ]
            ]
        ],
        'create' => [
            'title' => 'Страница создания агента',
            'form' => [
                'title' => 'Создать агента',
                'input' => [
                    'agency' => [
                        'label' => 'Выбрать агенство:'
                    ]
                ],
                'errors' => [
                    'agency_id' => [
                        'required' => 'Необходимо выбрать агенство',
                    ],
                    'user_id' => [
                        'unique' => 'Данный агент уже зарегистрирован'
                    ]
                ]
            ]
        ],
        'index' => [
            'filter' => [
                'modal' => [
                    'title' => 'Фильтр агентов'
                ]
            ],
            'order' => [
                'modal' => [
                    'title' => 'Сортировка агентов'
                ]
            ],
            'title' => 'Список агентов',
            'nav' => 'Агенты',
            'block' => [
                'agents' => [
                    'title' => 'Список агентов',
                    'description' => 'Здесь вы можете порсмотреть список агентов'
                ]
            ]
        ]
    ]
];
