<?php

return [
    'nav' => 'Агенства',
    'page' => [
        'profile' => [
            'title' => 'Мои агенства',
            'block' => [
                'list' => [
                    'title' => 'Мои агенства',
                    'description' => 'Здесь вы можете просмотреть список своих агенств, а также <a href="' . route('agency.create') . '">создать</a> новые.',
                    'link' => [
                        'create' => 'Создать агенство'
                    ]
                ]
            ],
            'nav' => 'Кабинет агенства'
        ]
    ]
];
