<?php

return [
    'title' => config('app.name') . ' - поиск и подбор недвижимости.',
    'description' => config('app.name') . ' - открытая платформа поиска и подбора недвижимости.',
    'platform' => [
        'welcome' => 'Добро пожаловать на платформу ATFLAT.',
        'slogan' => 'Мы ищем и находим невижимость для Вас.',
        'link_text' => 'Просто <a href="https://vk.com/atflat_group">оставьте заявку</a> на поиск и подбор недвижимости и мы начнем поиск.',
    ],
    'form' => [
        'save' => 'Сохранить',
        'create' => 'Создать',
        'not_select' => 'Не выбрано',
    ],
    'button' => [
        'load_more' => 'Загрузить ещё'
    ],
    '403' => [
        'description' => 'У Вас недостаточно прав для просмотра данной страницы'
    ]
];
